android_onvif/src/main/assets/setSystemDateAndTime.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <Security xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" s:mustUnderstand="1">
            <UsernameToken>
                <Username>%s</Username>
                <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">%s</Password>
                <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">%s</Nonce>
                <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">%s</Created>
            </UsernameToken>
        </Security>
    </s:Header>
    <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <SetSystemDateAndTime xmlns="http://www.onvif.org/ver10/device/wsdl">
            <DateTimeType>Manual</DateTimeType>
            <DaylightSavings>false</DaylightSavings>
            <TimeZone>
                <TZ xmlns="http://www.onvif.org/ver10/schema">CST-0:00:00</TZ>
            </TimeZone>
            <UTCDateTime>
                <Date xmlns="http://www.onvif.org/ver10/schema">
                    <Year>%s</Year>
                    <Month>%s</Month>
                    <Day>%s</Day>
                </Date>
                <Time xmlns="http://www.onvif.org/ver10/schema">
                    <Hour>%s</Hour>
                    <Minute>%s</Minute>
                    <Second>%s</Second>
                </Time>
            </UTCDateTime>
        </SetSystemDateAndTime>
    </s:Body>
</s:Envelope>
